{
  "ingredientMappings": {
    "hfcs": "high fructose corn syrup",
    "high-fructose corn syrup": "high fructose corn syrup",
    "sodium benzo": "sodium benzoate"
  },
  "ingredients": {
    "sodium benzoate": "Can form benzene, a known carcinogen, in acidic conditions.",
    "high fructose corn syrup": "Linked to obesity and increased risk of diabetes.",
    "aspartame": "May cause headaches, dizziness, and potential long-term health risks.",
    "Test": "May cause headaches, dizziness, and potential long-term health risks.",
    "monosodium glutamate": "May cause headaches, flushing, sweating, and chest pain (known as 'Chinese Restaurant Syndrome').",
    "artificial food colorings": "May cause hyperactivity in children and allergic reactions.",
    "BHA": "A possible carcinogen and may interfere with hormone functions.",
    "BHT": "Potentially harmful to the liver and kidneys when consumed in high quantities.",
    "trans fat": "Increases the risk of heart disease, stroke, and type 2 diabetes.",
    "partially hydrogenated oils": "Contain trans fats which raise LDL (bad) cholesterol and lower HDL (good) cholesterol.",
    "sodium nitrite": "Used in processed meats and linked to an increased risk of cancer.",
    "azodicarbonamide": "May cause asthma or respiratory issues and is often used in bread making.",
    "high-fructose corn syrup": "Linked to obesity and increased risk of diabetes.",
    "sucrose": "May contribute to obesity, diabetes, and heart disease when consumed in excess.",
    "corn syrup": "High in sugar and can lead to weight gain and insulin resistance.",
    "msg": "May cause headaches, sweating, chest pain, and allergic reactions.",
    "high fructose corn syrup (HFCS)": "Raises blood sugar levels, contributing to obesity and diabetes.",
    "saccharin": "A sugar substitute linked to bladder cancer in animal studies.",
    "sucralose": "Potential to alter gut microbiota and has been linked to metabolic issues.",
    "cyclamate": "Banned in the U.S. for potential cancer risks.",
    "propylparaben": "May disrupt endocrine function and cause allergic reactions.",
    "butylparaben": "Can disrupt the endocrine system, leading to hormone imbalances.",
    "phthalates": "Linked to reproductive issues and developmental disorders.",
    "benzoic acid": "Can cause allergic reactions and is associated with asthma and skin irritation.",
    "sorbitol": "Can cause digestive upset, including bloating, gas, and diarrhea.",
    "xylitol": "May cause digestive discomfort in large amounts and can be toxic to dogs.",
    "polysorbate 80": "May cause digestive issues and allergic reactions in sensitive individuals.",
    "carrageenan": "May cause gastrointestinal inflammation and is linked to cancer in animal studies.",
    "MSG (monosodium glutamate)": "Can trigger migraines and cause symptoms like flushing, sweating, and a tight chest.",
    "yellow 5": "Linked to hyperactivity in children and allergic reactions.",
    "yellow 6": "May cause allergic reactions and is associated with cancer in animal studies.",
    "red 40": "Known to cause hyperactivity in children and can trigger allergic reactions.",
    "blue 1": "Has been linked to allergic reactions, especially in people with asthma.",
    "blue 2": "Can cause allergic reactions and may be carcinogenic in high amounts.",
    "green 3": "May cause allergic reactions and is banned in some countries.",
    "natural flavors": "Can contain a variety of chemicals and additives, some of which may cause allergic reactions.",
    "artificial sweeteners": "Linked to various health concerns, including headaches and digestive issues.",
    "lactose": "Can cause digestive issues for those who are lactose intolerant.",
    "gluten": "Can trigger allergic reactions and digestive issues in those with gluten sensitivity or celiac disease.",
    "casein": "A milk protein that can cause allergic reactions in sensitive individuals.",
    "soy lecithin": "May contain trace amounts of soy allergens, which can cause reactions in sensitive individuals.",
    "cornstarch": "A high-glycemic food that can lead to rapid blood sugar spikes.",
    "propyl gallate": "A preservative that may cause allergic reactions and is linked to certain cancers.",
    "calcium propionate": "A preservative that can cause asthma and allergic reactions in sensitive individuals.",
    "sodium chloride": "Excessive consumption is linked to high blood pressure and heart disease.",
    "potassium sorbate": "Can cause allergic reactions in sensitive individuals.",
    "glucose": "Can cause blood sugar spikes and contribute to obesity and diabetes when consumed in excess.",
    "fructose": "Can lead to insulin resistance and contribute to metabolic syndrome when consumed in excess.",
    "lactic acid": "Can cause digestive upset in some individuals when consumed in large amounts.",
    "malic acid": "Can cause irritation to the digestive system in some individuals.",
    "citric acid": "May cause irritation to the mouth and throat, especially in sensitive individuals.",
    "titanium dioxide": "May cause gastrointestinal irritation and is linked to inflammation.",
    "disodium inosinate": "May trigger asthma and allergic reactions in sensitive individuals."
  }
}
